// Напишите программу которая на вход принимает число
// и выдает его квадрат
Console.WriteLine("Write a number: ");
string num_srt = Console.ReadLine()!; 
int num = int.Parse(num_srt); 
Console.WriteLine( num * num ); 